[
    {
        "agent": "Marcus Rush",
        "email": "marcus@rushhome.com",
        "phone": "302-257-3883",
        "details": ""
    },
    {
        "agent": "Bert Ferguson",
        "email": "bertf@rushhome.com",
        "phone": "(302) 204-1347",
        "details": "My name is Bert Ferguson and I am a Realtor with Rush Home in Smyrna, Delaware. Choosing a Realtor is one of the most important decisions you will make as you enter the market, and I want to help make that decision a smart one. I've been a Delaware Resident for over 15 years, so I am knowledgable on local properties and the surrounding area. Having been a Marketing and Management entrepreneur for 6 years, I have the experience that will allow me to engage in the proper marketing techniques to help you fulfill your real estate needs. <br/>In my spare time I enjoy working on my fitness goals, reading, blogging , and cooking. My goal is to ensure I lend you a helping hand on each step in the purchasing or selling process. I pride myself in being a person who loves helping others so I would be honored to help you achieve your real estate goals."
    },
    {
        "agent": "Leroy Gaines",
        "email": "leroygaines@rushhome.com",
        "phone": "(302) 204-1485",
        "details": "I'm an experienced REALTOR/ASSOCIATE BROKER, licensed in Delaware, Maryland and Pennsylvania. I specialize in residential real estate for Buyers and Sellers. I provide services for first time home buyers, as well as experienced buyers looking to move up or down size. My clients note that my ability to negotiate in their best interest has proven that no matter how complex the deal may seem we navigate their transaction seamless thus providing quality services and a memorable experience. Prior to my career change, I owned/operated ATC Hardwood Floors, Inc. for eleven years. Our services included, Sales, Installation and Refinishing Custom Hardwood floors. I am presently a Full time Professional Sales Associate who is committed to providing you, your family and friends with exceptional service. I pride myself in being surrounded by the necessary resources, being fully trained and equipped to take a unique and proactive approach to meeting all of your real estate needs. I am committed to building life long relationships through the wonderful experience of real estate. It would be an honor to serve you."
    },
    {
        "agent": "Chennita Crawford",
        "email": "chennita@rushhome.com",
        "phone": "(302) 321-1801",
        "details": ""
    },
    {
        "agent": "Marquise Broom",
        "email": "marquise@rushhome.com",
        "phone": "(302) 233-7056",
        "details": "Marquise is a military retiree who moved to Delaware to be closer to friends and family. Marquise decided to become a Realtor because he desires to give back to his community through selfless service and he is passionate about assisting others procure the home of their dreams. Marquise uses his past experiences and training to provide his customers with the highest level of Dedication, Communication, Determination, & Trust. He can cater and adapt to all his client's Real Estate needs in the ever-changing market. In addition, he provides exceptional Real Estate services to ensure you feel confident with your decision to hire him. Marquise is a graduate of Columbia College in Missouri, with a degree in Business Administration. Marquise has been working in Real Estate since 2021 and is a Certified Military Relocation Professional (MRP). Marquise's clients often describe her as trust-worthy, all ways available, and easy work with. Marquise proudly volunteers at Felton Fire Station, Felton Veteran's of Foreign Wars (VFW), and Disabled American Veterans. He is committed to building new life-long associates from your experience with him and he prides himself on referral business. It is my honor and privilege to be of service. "
    },
    {
        "agent": "Chris Harper",
        "email": "chrisharper@rushhome.com",
        "phone": "(302) 360-5017",
        "details": "Christopher Harper is a native of Salisbury Maryland and served in the Maryland Army National Guard. Mr. Harper graduated from Wilmington University with a Bachelors of Science Degree in 2012 and obtained his Masters Degree in Administration of Justice in 2013. Mr. Harper is a retired Federal Law Enforcement (Lieutenant). Mr. Harper loves lifting weights, watching movies and golfing. Mr. Harper is a licensed real-estate agent in Maryland and Delaware."
    },
    {
        "agent": "Yazmin Parrish",
        "email": "yazmin.parrish@rushhome.com",
        "phone": "",
        "details": ""
    },
    {
        "agent": "Kita Miller",
        "email": "kita.miller@rushhome.com",
        "phone": "(302) 244-5598",
        "details": ""
    },
    {
        "agent": "Raquel Gomez",
        "email": "raquelgomez@rushhome.com",
        "phone": "(302) 406-1781",
        "details": ""
    },
    {
        "agent": "Shakiah Davis",
        "email": "mrskiadavis@rushhome.com",
        "phone": "",
        "details": ""
    },
    {
        "agent": "SHANENE SEWELL",
        "email": "shanene@rushhome.com",
        "phone": "",
        "details": ""
    },
    {
        "agent": "Wandre Brown",
        "email": "wandrebrown@rushhome.com",
        "phone": "(301) 900-3157",
        "details": ""
    },
    {
        "agent": "Danielle Franchi",
        "email": "danielle.franchi@rushhome.com",
        "phone": "(410) 280-7874",
        "details": ""
    },
    {
        "agent": "Naadia Brown",
        "email": "naadiabrown@rushhome.com",
        "phone": "(267) 656-6903",
        "details": "Let me introduce myself - I'm Naadia Brown, a dedicated, qualified, ambitious Real Estate Professional committed to your success and the protection of your best interests. Unambitious, unmotivated, and unprofessional are words that were never associated with my name. I take my job very seriously, and I approach it with impeccable responsibility, dedication and commitment.<br/><br/>I fully understand that as someone who is looking for a place to settle in for the first time or for the rest of their life, the last thing a client needs is someone unprofessional and not committed to their needs or interest. I will try my best to take out the tedious and unpleasant part out of your transaction. Therefore, I will make sure to deliver a unique solution carefully tailored to each individual needs and requirements of my clients in a direct, honest and mutually beneficial manner.<br/><br/>Being so motivated and ambitious to help and add value to others I became a Correctional Professional in 2009. During my 12 years in that career field, I was able to help over 30 incarcerated men obtain their GED and attend college Courses. I then went on to work in a call center where customer service was number 1 on my list each day while receiving and giving pertinent information to my superior officers or the families of the incarcerated. This was a job in which communication, organization and decisiveness was a crucial element of success, just like with real estate business. During that journey I never lost sight of my goal which was to become a real estate professional.<br/><br/>As I think about it, I can remember the time I bought my first home. All the confusion and misinformation in the buying process I experienced didn't even become obvious until I've learned what it truly means to understand, be informed, and clear on what you want in your home. I fully understand how tedious, confusing and challenging the process of buying your home can be, which is why I strive towards providing you with all the information you could possibly need to make the best decision based on what you want and how to achieve all your real estate related needs while enjoying the process. "
    },
    {
        "agent": "Seveta Green",
        "email": "sgreen@rushhome.com",
        "phone": "(302) 508-4687",
        "details": ""
    }
]